In [ ]:
import pandas as pd

data = {  "City"  : ["Taxila" , "Peshawar" , "Multan", "Peshawar" , "Multan" , "Taxila","Multan" , "peshawar" , "Taxila"],
        "Rank"   : ["Ist" , "2nd" , "2nd" , "2nd" , "2nd" , "Ist" , "2nd" , "2nd" , "Ist"],
        "Game1"  : [2,6,4,2,7,4,23,8,3],
        "Game2"  : [20,6,43,54,1,3,6,4,2]
    
}
data

In [ ]:
df = pd.DataFrame(data , index = pd.Index(["A","B" , "C" , "D" ,"E" , "F","I" , "J" ,"K"]) , columns = pd.Index(["City" , "Rank" , "Game1" , "Game2"]))
df

In [ ]:
df.groupby("City")

In [ ]:
list(df.groupby("City"))

In [ ]:
dict(list(df.groupby("City")))

In [ ]:
dict(list(df.groupby("City")))["Taxila"]

In [ ]:
df["City"]

In [ ]:
list(df["City"])

In [ ]:
list(df["City"].groupby(df["Rank"]))

In [ ]:
dict(list(df.groupby(["City" , "Rank"])))

# Concat function

In [26]:
data1 = {"Names" : ["Ali" , "Ahmed" , "Bilal" , "Khawar"],
        "Id" : [10,20,30,40],
        "Subjects" : ["English" , "Urdu" , "Math" , "Pak Studies"]}
undergraduate_student = pd.DataFrame(data1 , columns = ["Id" , "Names" , "Subjects"])     #es sy hum apni marzi sy column ki jaga select kr sakty hain warna compiler apni marzi sy koi random jaga select kr ly ga
undergraduate_student

   Id   Names     Subjects
0  10     Ali      English
1  20   Ahmed         Urdu
2  30   Bilal         Math
3  40  Khawar  Pak Studies

In [32]:
data2 = {"Names" : ["Shani" , "Faizi" , "Bilal" , "Shazil"],
        "Id" : [50,60,70,80],
        "Subjects" : ["pf" , "Linear" , "python" , "Studies"]}
undergraduate_student1 = pd.DataFrame(data1 , columns = ["Id" , "Names" , "Subjects"])
undergraduate_student1

    Names  Id     Subjects
0     Ali  10      English
1   Ahmed  20         Urdu
2   Bilal  30         Math
3  Khawar  40  Pak Studies

In [31]:
pd.concat([undergraduate_student,undergraduate_student1])

   Id   Names     Subjects
0  10     Ali      English
1  20   Ahmed         Urdu
2  30   Bilal         Math
3  40  Khawar  Pak Studies
0  10     Ali      English
1  20   Ahmed         Urdu
2  30   Bilal         Math
3  40  Khawar  Pak Studies

In [34]:
pd.concat([undergraduate_student,undergraduate_student1] , ignore_index = True)     #Es sy index ka sequence Thk kr dy ga warn uper waly column main kharab tha

   Id   Names     Subjects
0  10     Ali      English
1  20   Ahmed         Urdu
2  30   Bilal         Math
3  40  Khawar  Pak Studies
4  10     Ali      English
5  20   Ahmed         Urdu
6  30   Bilal         Math
7  40  Khawar  Pak Studies

In [36]:
pd.concat([undergraduate_student,undergraduate_student1] , axis = 1 , ignore_index = True)   #by default axis zero hota ha jis row wise means data k neechay he concat kr deta ha or column wise data k agy concat kr deta ha es k liye hamain likna parta ha axis = 1

    0       1            2       3   4            5
0  10     Ali      English     Ali  10      English
1  20   Ahmed         Urdu   Ahmed  20         Urdu
2  30   Bilal         Math   Bilal  30         Math
3  40  Khawar  Pak Studies  Khawar  40  Pak Studies

In [44]:


a= pd.concat([undergraduate_student , undergraduate_student1] , keys = ["first student" , "second student"])   #es sy hum apni marzi sy keys set krty hain jab hamary pas zada data ho to asani sy kisi 1 key ka data find kr sakain
a

                  Id   Names     Subjects
first student  0  10     Ali      English
               1  20   Ahmed         Urdu
               2  30   Bilal         Math
               3  40  Khawar  Pak Studies
second student 0  10     Ali      English
               1  20   Ahmed         Urdu
               2  30   Bilal         Math
               3  40  Khawar  Pak Studies

In [47]:
a.loc["second student"]

   Id   Names     Subjects
0  10     Ali      English
1  20   Ahmed         Urdu
2  30   Bilal         Math
3  40  Khawar  Pak Studies

# merge Function

In [48]:
a = {"Names" : ["Ali" , "Ahmed" , "Bilal" , "Khawar" , "Shani"] , 
    "Ages" : [21 , 22 ,28 , 24 , 20]}
df1  =  pd.DataFrame(a)
df1

    Names  Ages
0     Ali    21
1   Ahmed    22
2   Bilal    28
3  Khawar    24
4   Shani    20

In [49]:
b = {"Names" : ["Faizi" , "Shazil" , "Bilal" , "hamza" , "Shani"] , 
    "Ages" : [20 , 18 ,28 , 17 , 20]}
df2  =  pd.DataFrame(b)
df2

    Names  Ages
0   Faizi    20
1  Shazil    18
2   Bilal    28
3   hamza    17
4   Shani    20

In [52]:
pd.merge(df1 , df2, on = "Names")  #es function main sirf common values print kry ga

   Names  Ages_x  Ages_y
0  Bilal      28      28
1  Shani      20      20

In [55]:
pd.merge(df1 , df2, on = "Names" , how = "right")  #es main jo hum ny right main df2 function likha howa ha uski values or df1 main or df2 main jo common values hain unko print kr fy ga

    Names  Ages_x  Ages_y
0   Faizi     NaN      20
1  Shazil     NaN      18
2   Bilal    28.0      28
3   hamza     NaN      17
4   Shani    20.0      20

In [56]:
pd.merge(df1 , df2, on = "Names" , how = "left")  #es main jo hum ny left main df1 function likha howa ha uski values or df2 main or df2 main jo common values hain unko print kr fy ga

    Names  Ages_x  Ages_y
0     Ali      21     NaN
1   Ahmed      22     NaN
2   Bilal      28    28.0
3  Khawar      24     NaN
4   Shani      20    20.0

In [57]:
pd.merge(df1 , df2, on = "Names" , how = "outer")  #es main jo df1 main or df2 main jo jo values hain wo ssub print kr dy ga jo jo common hain unko 1 bar merge kr k likh dy ga

    Names  Ages_x  Ages_y
0     Ali    21.0     NaN
1   Ahmed    22.0     NaN
2   Bilal    28.0    28.0
3  Khawar    24.0     NaN
4   Shani    20.0    20.0
5   Faizi     NaN    20.0
6  Shazil     NaN    18.0
7   hamza     NaN    17.0

In [58]:
pd.merge(df1 , df2, on = "Names" , how = "inner")  #inner ka matlab ha jo dono functions main common vakues hain unko print kr dy ga or by default B yeh inner he hota halikhain na likhain 1 he ,matlab hota ha

   Names  Ages_x  Ages_y
0  Bilal      28      28
1  Shani      20      20

In [60]:
pd.merge(df1 , df2, on = "Names" , how = "right" , indicator = True)  #es main hamain yrh btay ga k kin da left sy select howa ha or konsa right sy howa ha or konsi values dono main majood thi

    Names  Ages_x  Ages_y      _merge
0   Faizi     NaN      20  right_only
1  Shazil     NaN      18  right_only
2   Bilal    28.0      28        both
3   hamza     NaN      17  right_only
4   Shani    20.0      20        both

# melt function

In [62]:
file = pd.read_csv("city data.csv")
file

        Days  Islamabad  Peshawar  Multan
0     Monday         12         4      12
1    Tuesday         15        55      13
2  Wednesday          4        12       5
3   Thursday         21        10      12
4     Friday          5         6       2
5  Saturaday         45         7      11
6     Sunday         44         8      10

In [65]:
pd.melt(file , id_vars = ["Days"])    #agr hum  id vars  = days na krty to yeh sub kch 1 he line main print ho ho jata variable main sari string values aajti jis main daya or city sub kch 1 he line main hota or value main sari integer values aati jis main sub interger values 1 he line main hoti

         Days   variable  value
0      Monday  Islamabad     12
1     Tuesday  Islamabad     15
2   Wednesday  Islamabad      4
3    Thursday  Islamabad     21
4      Friday  Islamabad      5
5   Saturaday  Islamabad     45
6      Sunday  Islamabad     44
7      Monday   Peshawar      4
8     Tuesday   Peshawar     55
9   Wednesday   Peshawar     12
10   Thursday   Peshawar     10
11     Friday   Peshawar      6
12  Saturaday   Peshawar      7
13     Sunday   Peshawar      8
14     Monday     Multan     12
15    Tuesday     Multan     13
16  Wednesday     Multan      5
17   Thursday     Multan     12
18     Friday     Multan      2
19  Saturaday     Multan     11
20     Sunday     Multan     10

In [69]:
dfff = pd.melt(file , id_vars = ["Days"])
dfff[dfff["variable"] == "Multan"]      #es function sy humy sirf  multan ka sara data mil jay ga

         Days variable  value
14     Monday   Multan     12
15    Tuesday   Multan     13
16  Wednesday   Multan      5
17   Thursday   Multan     12
18     Friday   Multan      2
19  Saturaday   Multan     11
20     Sunday   Multan     10

In [73]:
pd.melt(file , id_vars = ["Days"] , var_name = "Citites" , value_name = "profit")    #es sy hum apny variable or values k name chhange kr saty hain

         Days    Citites  profit
0      Monday  Islamabad      12
1     Tuesday  Islamabad      15
2   Wednesday  Islamabad       4
3    Thursday  Islamabad      21
4      Friday  Islamabad       5
5   Saturaday  Islamabad      45
6      Sunday  Islamabad      44
7      Monday   Peshawar       4
8     Tuesday   Peshawar      55
9   Wednesday   Peshawar      12
10   Thursday   Peshawar      10
11     Friday   Peshawar       6
12  Saturaday   Peshawar       7
13     Sunday   Peshawar       8
14     Monday     Multan      12
15    Tuesday     Multan      13
16  Wednesday     Multan       5
17   Thursday     Multan      12
18     Friday     Multan       2
19  Saturaday     Multan      11
20     Sunday     Multan      10